app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["email", "margabakti@gmail.com"], ["phone", "192931209"], ["twitter", "@popoloo"], ["updated_at", "2024-04-17 06:01:14.730610"], ["id", 15]]

  def destroy
    @friend.destroy!
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 15]]